In [1]:
%defaultDatasource jdbc:h2:mem:db

# Primeiro conjunto de tabelas para consultas básicas

In [2]:
DROP TABLE IF EXISTS Taxi;
DROP TABLE IF EXISTS Cliente;
DROP TABLE IF EXISTS Corrida;

CREATE TABLE Taxi (
  Placa VARCHAR(7) NOT NULL,
  Marca VARCHAR(30) NOT NULL,
  Modelo VARCHAR(30) NOT NULL,
  AnoFab INTEGER,
  Licenca VARCHAR(9),
  PRIMARY KEY(Placa)
);

CREATE TABLE Cliente (
  CliId VARCHAR(4) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CPF VARCHAR(14) NOT NULL,
  PRIMARY KEY(CliId)
);

CREATE TABLE Corrida (
  CliId VARCHAR(4) NOT NULL,
  Placa VARCHAR(7) NOT NULL,
  DataPedido DATE NOT NULL,
  PRIMARY KEY(CliId, Placa, DataPedido),
  FOREIGN KEY(CliId)
    REFERENCES Cliente(CliId)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION,
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

In [3]:
INSERT INTO Cliente VALUES ('1532', 'Asdrúbal', '448.754.253-65');
INSERT INTO Cliente VALUES ('1755', 'Doriana', '567.387.387-44');
INSERT INTO Cliente VALUES ('1780', 'Quincas', '546.373.762-02');

INSERT INTO Taxi VALUES ('DAE6534', 'Ford', 'Fiesta', 1999, 'MN572345');
INSERT INTO Taxi VALUES ('DKL4598', 'Wolkswagen', 'Gol', 2001, 'AU876543');
INSERT INTO Taxi VALUES ('DKL7878', 'Ford', 'Fiesta', 2001, 'OP102938');
INSERT INTO Taxi VALUES ('JDM8776', 'Wolkswagen', 'Santana', 2002, 'QM365923');
INSERT INTO Taxi VALUES ('JJM3692', 'Chevrolet', 'Corsa', 1999, 'UU335577');

INSERT INTO Corrida VALUES ('1755', 'DAE6534', '2003-02-15');
INSERT INTO Corrida VALUES ('1780', 'JDM8776', '2003-02-18');
INSERT INTO Corrida VALUES ('1755', 'DKL7878', '2003-02-16');
INSERT INTO Corrida VALUES ('1780', 'DKL4598', '2003-02-17');
INSERT INTO Corrida VALUES ('1532', 'DKL4598', '2003-02-18');
INSERT INTO Corrida VALUES ('1780', 'DAE6534', '2003-02-16');

# Segundo conjunto de tabelas para consultas avançadas

In [4]:
DROP TABLE IF EXISTS Motorista;
DROP TABLE IF EXISTS Zona;
DROP TABLE IF EXISTS Fila;

CREATE TABLE Motorista (
  CNH VARCHAR(6) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CNHValid INTEGER,
  Placa VARCHAR(7) NOT NULL,
  PRIMARY KEY(CNH),
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

CREATE TABLE Zona (
  Zona VARCHAR(40) NOT NULL,
  PRIMARY KEY(Zona)
);

CREATE TABLE Fila (
   Zona VARCHAR(40) NOT NULL,
   CNH VARCHAR(6) NOT NULL,
   DataHoraIn TIMESTAMP,
   DataHoraOut TIMESTAMP,
   KmIn INTEGER,
   PRIMARY KEY (Zona, CNH),
   FOREIGN KEY(Zona)
     REFERENCES Zona(Zona)
       ON DELETE NO ACTION
       ON UPDATE NO ACTION,
   FOREIGN KEY(CNH)
     REFERENCES Motorista(CNH)
       ON DELETE NO ACTION
       ON UPDATE NO ACTION
);

In [5]:
INSERT INTO Taxi VALUES ('DXF5263', 'Ford', 'Escort', 2001, 'GG5263526');
INSERT INTO Taxi VALUES ('MJN6578', 'Wolkswagen', 'Santana', 1998, 'KL856326');
INSERT INTO Taxi VALUES ('MLA4545', 'Wolkswagen', 'Gol', 2000, 'YK6574837');
INSERT INTO Taxi VALUES ('DXA7878', 'Ford', 'Escort', 2000, 'GG5263526');
INSERT INTO Taxi VALUES ('DXF6767', 'Wolkswagen', 'Santana', 1998, 'YK7890081');

INSERT INTO Motorista VALUES ('657483', 'Asdrubal', 1, 'DXF5263');
INSERT INTO Motorista VALUES ('567892', 'Quincas', 1, 'MLA4545');
INSERT INTO Motorista VALUES ('452635', 'Zandor', 1, 'DXA7878');
INSERT INTO Motorista VALUES ('452452', 'Alcebiades', 1, 'DXF6767');
INSERT INTO Motorista VALUES ('555555', 'Bonerges', 1, 'DAE6534');
INSERT INTO Motorista VALUES ('987654', 'Doriana', 1, 'JDM8776');

INSERT INTO Zona VALUES ('Barão Geraldo');
INSERT INTO Zona VALUES ('Cambuí');
INSERT INTO Zona VALUES ('Taquaral');
INSERT INTO Zona VALUES ('Unicamp');

INSERT INTO Fila VALUES ('Barão Geraldo', '567892', '2002-06-05 09:00:00', '2002-06-05 09:30:00', 4630);
INSERT INTO Fila VALUES ('Barão Geraldo', '657483', '2002-06-05 07:30:00', '2002-06-05 07:45:00', 1567);
INSERT INTO Fila VALUES ('Taquaral', '452452', '2002-06-05 09:00:00', '2002-06-05 09:50:00', 5000);
INSERT INTO Fila VALUES ('Taquaral', '657483', '2002-06-06 08:00:00', '2002-06-06 08:07:00', 7900);
INSERT INTO Fila VALUES ('Unicamp', '452635', '2002-06-02 08:00:00', '2002-06-02 08:00:00', 4800);
INSERT INTO Fila VALUES ('Unicamp', '567892', '2002-06-06 06:00:00', '2002-06-06 06:00:00', 5263);
INSERT INTO Fila VALUES ('Unicamp', '657483', '2002-06-06 23:00:00', '2002-06-06 23:00:00', 4541);
INSERT INTO Fila VALUES ('Unicamp', '452452', '2002-06-05 10:30:00', '2002-06-05 10:30:00', 7800);
INSERT INTO Fila VALUES ('Taquaral', '555555', '2002-06-06 08:10:00', '2002-06-06 08:10:00', 7910);
INSERT INTO Fila VALUES ('Unicamp', '987654', '2002-06-05 10:30:00', '2002-06-05 10:35:00', 7850);

# Exemplos de aninhamento de consulta

## Zonas que receberam algum taxi na fila (sem aninhamento)

In [7]:
SELECT DISTINCT Z.zona
FROM Zona Z, Fila F
WHERE Z.zona = F.zona;

## Zonas que receberam algum taxi na fila (com aninhamento / IN)

In [9]:
SELECT Z.zona
FROM Zona Z
WHERE Z.zona IN (SELECT DISTINCT F.zona FROM Fila F);

## Zonas que receberam algum taxi na fila (com aninhamento / EXISTS)

In [11]:
SELECT Z.zona
FROM Zona Z
WHERE EXISTS (SELECT * FROM Fila F WHERE F.zona = Z.zona);

## Zonas que nao receberam algum taxi na fila (com aninhamento / NOT IN)

In [13]:
SELECT Z.zona
FROM Zona Z
WHERE Z.zona NOT IN (SELECT DISTINCT F.zona FROM Fila F);

Cambuí

## Zonas que nao receberam algum taxi na fila (com aninhamento / NOT EXISTS)

In [14]:
SELECT Z.zona
FROM Zona Z
WHERE NOT EXISTS (SELECT * FROM Fila F WHERE F.zona = Z.zona);

Cambuí

## Taxis modelo Fiesta

In [15]:
SELECT T.placa, T.modelo FROM Taxi T WHERE T.modelo = 'Fiesta';

## Nome dos clientes que andaram nos taxis modelo Fiesta (sem aninhamento)

In [16]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co, Taxi Tx
WHERE Cl.cliid = Co.cliid AND Co.placa = Tx.placa AND
      Tx.modelo = 'Fiesta';

## Nome dos clientes que andaram nos taxis modelo Fiesta (com aninhamento)

In [18]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co
WHERE Cl.cliid = Co.cliid AND
      Co.placa IN (SELECT Tx.placa FROM Taxi Tx
                   WHERE Tx.modelo = 'Fiesta');

## Nome dos clientes que andaram no taxi dirigido por Bonerges

In [19]:
SELECT DISTINCT Cl.nome
FROM Cliente Cl, Corrida Co
WHERE Cl.cliid = Co.cliid AND
      Co.placa = (SELECT Tx.placa FROM Taxi Tx, Motorista Mo
                  WHERE Tx.placa = Mo.placa AND
                        Mo.nome = 'Bonerges');

## Taxis que entraram na fila antes da primeira entrada de Alcebiades

In [20]:
SELECT Mo.placa, Fi.datahorain
FROM Motorista Mo, Fila Fi
WHERE Mo.cnh = Fi.cnh AND
      Fi.datahorain < (SELECT MIN(F.datahorain)
                       FROM Motorista M, Fila F
                       WHERE M.cnh = F.cnh AND
                             M.nome = 'Alcebiades');

## Quem foi o primeiro motorista a entrar em qualquer uma das filas

In [22]:
SELECT Mo.nome, Fi.datahorain
FROM Motorista Mo, Fila Fi
WHERE Mo.cnh = Fi.cnh AND
      Fi.datahorain <= ALL (SELECT datahorain FROM Fila);

## Quem nao foi o primeiro motorista a entrar em qualquer uma das filas

In [23]:
SELECT Mo.nome, Fi.datahorain
FROM Motorista Mo, Fila Fi
WHERE Mo.cnh = Fi.cnh AND
      Fi.datahorain > ANY (SELECT DataHoraIn FROM Fila);